{"pages":[{"title":"关于","text":"A simple, delicate, and modern theme for the static site generator Hexo. Preview | Documentation | Download :cd: InstallationDownload &amp; extract or git clone Icarus from GitHub to your blog’s theme folder, and that’s it! 1git clone https://github.com/ppoffice/hexo-theme-icarus.git themes/icarus Once started, Icarus will remind you of any missing dependencies and configuration files. :gift: FeaturesExtensive Plugin Support Icarus includes plentiful search, comment, sharing and other plugins out of the box. You can choose any of them to enrich yourblog experience, or build your own plugin easily referring to the existing Icarus plugins. Comment plugins Changyan Disqus Facebook Gitment Isso LiveRe Valine Search plugins Insight Search Google Custom Search Engine Baidu Site Search Share plugins AddThis AddToAny Baidu Share Share.js ShareThis Donation Buttons Alipay Wechat Paypal Patreon Other plugins Hexo Tag Plugin lightGallery &amp; Justified Gallery MathJax Site Analytics Rich Code Highlight Theme Choices Icarus directly import code highlight themes from the highlight.js package, and makes more than70 highlight themes available to you. Elastic Theme Configuration In addition to the minimalistic and easy-to-understand configuration design, Icarus allows you to set configurations on aper-page basis with the ability to merge and override partial configurations. _config.yml post.md menu: Archives: /archives Categories: /categories Tags: /tags About: /about title: A Simple Post menu: Go Home: /index.html --- # Here is some simple markdown. Responsive Layout No matter what modern browsering device your audiences are using, they can always get the best experience because Icarus’s responsivelayout across multiple viewpoints. :hammer: DevelopmentThis project is built with Hexo 3.7.1 Ejs Stylus Bulma 0.7.2 Please refer to the documentation for Icarus implementation details. :tada: ContributeIf you feel like to help us build a better Icarus, you can :electric_plug: Write a plugin |:black_nib: Submit a tutorial |:triangular_flag_on_post: Report a bug |:earth_asia: Add a translation :memo: LicenseThis project is licensed under the MIT License - see the LICENSE file for details.","link":"/%E5%85%B3%E4%BA%8E/index.html"},{"title":"标签","text":"","link":"/%E6%A0%87%E7%AD%BE/index.html"},{"title":"归档","text":"","link":"/%E5%BD%92%E6%A1%A3/index.html"},{"title":"分类","text":"","link":"/%E5%88%86%E7%B1%BB/index.html"}],"posts":[{"title":"MIMO论文整理","text":"大规模MIMO检测论文整理Survey &amp; TutorialDissertation (Doctoral or Master’s)Linear DetectorsNon-linear Detectors","link":"/2019/11/23/mimo-lun-wen-mu-lu-zheng-li/"},{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2019/11/19/hello-world/"}],"tags":[{"name":"MIMO Paper","slug":"MIMO-Paper","link":"/tags/MIMO-Paper/"},{"name":"Hello World for hexo","slug":"Hello-World-for-hexo","link":"/tags/Hello-World-for-hexo/"}],"categories":[{"name":"MIMO","slug":"MIMO","link":"/categories/MIMO/"}]}